tap "atlassian/acli"
tap "daipeihust/tap"
tap "k1low/tap"
tap "oven-sh/bun"
brew "act"
brew "age"
brew "bat"
brew "btop"
brew "dprint"
brew "duf"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "python@3.14"
brew "yt-dlp"
brew "gallery-dl"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "googleworkspace-cli"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "kubernetes-cli"
brew "mermaid-cli"
brew "miniserve"
brew "ncdu"
brew "pandoc"
brew "pass"
brew "playwright-cli"
brew "podman"
brew "podman-compose"
brew "qsv"
brew "ripgrep"
brew "rsync"
brew "sentry-cli"
brew "sing-box"
brew "starship"
brew "svgo"
brew "tealdeer"
brew "tectonic"
brew "television"
brew "tig"
brew "vim"
brew "xan"
brew "xh"
brew "yadm"
brew "yazi"
brew "you-get"
brew "yq"
brew "zellij"
brew "zola"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "atlassian/acli/acli"
brew "daipeihust/tap/im-select"
brew "k1low/tap/mo"
brew "oven-sh/bun/bun"
cask "bambu-studio"
cask "cc-switch"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "discord"
cask "feishu"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "google-gemini"
cask "logitech-g-hub"
cask "obsidian"
cask "podman-desktop"
cask "qqmusic"
cask "visual-studio-code"
cask "wechat"
cask "whatsapp"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jdinhlife.gruvbox"
vscode "lokalise.i18n-ally"
vscode "meta.pyrefly"
vscode "mikestead.dotenv"
vscode "moonshot-ai.kimi-code"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-vscode.vscode-typescript-next"
vscode "openai.chatgpt"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "stripe.vscode-stripe"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
npm "@larksuite/cli"
npm "pnpm"
