tap "daipeihust/tap"
tap "k1low/tap"
tap "oven-sh/bun"
brew "age"
brew "bat"
brew "btop"
brew "dprint"
brew "duf"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "python@3.14"
brew "yt-dlp"
brew "gallery-dl"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "kubernetes-cli"
brew "mermaid-cli"
brew "pandoc"
brew "podman"
brew "podman-compose"
brew "qsv"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "tealdeer"
brew "tectonic"
brew "television"
brew "tig"
brew "vim"
brew "xan"
brew "xh"
brew "yadm"
brew "yazi"
brew "you-get"
brew "yq"
brew "zellij"
brew "zola"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "daipeihust/tap/im-select"
brew "k1low/tap/mo"
brew "oven-sh/bun/bun"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-gemini"
cask "ngrok"
cask "obsidian"
cask "podman-desktop"
cask "visual-studio-code"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "jdinhlife.gruvbox"
vscode "mikestead.dotenv"
vscode "moonshot-ai.kimi-code"
vscode "ms-playwright.playwright"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
